Documents/ВозвратОтПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВозвратОтПокупателя</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииОтданные</xr:Item>
				<xr:Item>AccumulationRegister.ПодотчетныеЛица</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТМЦ</xr:Item>
				<xr:Item>AccumulationRegister.РезервыТМЦ</xr:Item>
				<xr:Item>AccumulationRegister.Касса</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыЗаявки</xr:Item>
				<xr:Item>AccumulationRegister.РеализованныйТовар</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.Заявки</xr:Item>
				<xr:Item>AccumulationRegister.КнигаПокупок</xr:Item>
				<xr:Item>AccumulationRegister.Заказы</xr:Item>
				<xr:Item>AccumulationRegister.Покупатели</xr:Item>
				<xr:Item>AccumulationRegister.Поставщики</xr:Item>
				<xr:Item>AccumulationRegister.Банк</xr:Item>
				<xr:Item>AccumulationRegister.ПартииНаличие</xr:Item>
				<xr:Item>AccumulationRegister.КнигаПродаж</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВклНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВклНП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОблагаетсяЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма документа в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДатаСФ</Name>
					<Comment>используется для вывода в книге продаж в случае возврата без указания документа-основания</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СвоиЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма_Итог</Name>
					<Comment>Сумма, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС_Итог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНП_Итог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатурная позиция</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Единицы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма, налоги включены согласно флагам</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСтатус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СебестоимостьЦена</Name>
							<Comment>(В валюте бух учета , без НДС)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Comment>(В валюте бух учета, без НДС)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СебестоимостьНДС</Name>
							<Comment>(В валюте бух учета)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВозвратОтПокупателя/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ МОДУЛЯ
// 

//******************************************************************************
// ВидДолгаПоСтатусу(СтатусПартии)
//
// Параметры:
//  СтатусПартии - значение перечисления статуса партии
//
// Возвращаемое значение:
//  Значение перечисления видов долга.
//
// Описание:
//  Возвращает вид долга, соответствующий статусу партии.
//
Функция ВидДолгаПоСтатусу(СтатусПартии)
//		
//	Если (СтатусПартии	= глСП.Т_Купленный) или
//		 (СтатусПартии	= глСП.Т_Тара) Тогда
//		Возврат глВД.ДолгЗаТовары;
//		
//	ИначеЕсли СтатусПартии	= глСП.Т_Принятый Тогда
//		Возврат глВД.ДолгЗаТоварыПринятые;
//		
//	ИначеЕсли СтатусПартии	= глСП.Т_ВРознице Тогда
//		Возврат глВД.ДолгЗаТовары;
//		
//	ИначеЕсли СтатусПартии	= глСП.Продукция Тогда
//		Возврат глВД.ДолгЗаПродукцию;
//		
//	ИначеЕсли СтатусПартии	= глСП.Полуфабрикат Тогда
//		Возврат глВД.ДолгЗаПолуфабрикаты;
//
//	ИначеЕсли Лев(СтатусПартии.Идентификатор(),2)	= "М_" Тогда
//		Возврат глВД.ДолгЗаМатериалы;
//		
//	Иначе     
//		глСообщениеПроведения("Неизвестный статус партии: "+СтатусПартии, ТекущийДокумент());
//	КонецЕсли;	
Возврат "";//	
КонецФункции // ВидДолгаПоСтатусу()

//******************************************************************************
// ПеремещениеИзРозницы(ТаблицаДокумента, ТаблСписПартий)
//
// Параметры: 
//  ТаблицаДокумента     - подготовленная таблица документа
//	ТаблСписПартий - партии, списанные по документу 
//
// Возвращаемое значение:
//  Нет
//
// Описание:
// Перемещает из розницы ТМЦ, проданные в розницу и возвращаемые на оптовый склад
//
Процедура ПеремещениеИзРозницы(ТаблицаДокумента, ТаблСписПартий, СписокПараметров)
//	
//	ТаблСписПартий.ВыбратьСтроки();
//	Пока  ТаблСписПартий.ПолучитьСтроку()=1 Цикл
//		Если ТаблСписПартий.СтатусПартии = Перечисление.СтатусыПартии.Т_ВРознице Тогда
//			//измерения
//			Регистр.ПартииНаличие. Фирма 			= Фирма;
//			Регистр.ПартииНаличие. МОЛ				= Склад.МОЛ;
//			Регистр.ПартииНаличие. Номенклатура		= ТаблСписПартий.Номенклатура;     
//			Регистр.ПартииНаличие. СтатусПартии	    = ТаблСписПартий.СтатусПартии;
//			Регистр.ПартииНаличие. КодОперации	    = глКО.ВозвратИзРозницы;  
//			Регистр.ПартииНаличие. Партия			= ТаблСписПартий.Партия;
//			Регистр.ПартииНаличие. ДатаПартии		= ТаблСписПартий.ДатаПартии;
//			
//			// Для определения продажной цены надо получить строку документа
//			ПолучитьСтрокуПоНомеру(ТаблСписПартий.НомерСтрокиДокумента);
//			Регистр.ПартииНаличие. ЦенаПрод			= ТаблСписПартий.ЦенаПрод;
//			
//			// ресурсы
//			Регистр.ПартииНаличие. Количество		= ТаблСписПартий.Количество;
//			Регистр.ПартииНаличие. СуммаУпр			= ТаблСписПартий.СуммаУпр;
//			Регистр.ПартииНаличие. СуммаРуб			= ТаблСписПартий.СуммаРуб;
//			Регистр.ПартииНаличие. СуммаБезНДС		= ТаблСписПартий.СуммаБезНДС;
//			// реквизиты                                          
//			
//			// Передаем из розницы по полной сумме без учета скидки
//			Регистр.ПартииНаличие.ПродСтоимость = ТаблСписПартий.СуммаПродРуб + ТаблСписПартий.СкидкаРуб;
//			
//			Регистр.ПартииНаличие.ПривязыватьСтроку(ТаблСписПартий.НомерСтрокиДокумента);
//			
//			Регистр.ПартииНаличие.Выручка = ТаблСписПартий.СуммаПродРуб - ТаблСписПартий.НДСПрод - ТаблСписПартий.НППрод;
//			
//			Регистр.ПартииНаличие.ДвижениеРасходВыполнить();
//			
//			// Оприходуем партию возврата
//			Регистр.ПартииНаличие. СтатусПартии	= Перечисление.СтатусыПартии.Т_Купленный; 
//			
//			Регистр.ПартииНаличие.ПродСтоимость = ТаблСписПартий.СуммаПродРуб;
//			Регистр.ПартииНаличие.ЦенаПрод	    = 0;
//			
//			Регистр.ПартииНаличие.Выручка = 0;
//			
//			Регистр.ПартииНаличие.ДвижениеПриходВыполнить();   
//		КонецЕсли;	                                                 
//	КонецЦикла;
//	
//	// оприходование
//	СписокПараметров.Установить("Склад", Склад);
//	СписокПараметров.Установить("Фирма", Фирма);
//	
КонецПроцедуры // ПеремещениеИзРозницы()
    

//******************************************************************************
// ПроведениеПоРегистрам()
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Нет.
//
// Описание:
//  Проведение по регистрам оперативного учета.
//
Процедура ПроведениеПоРегистрам()
	
	Перем ТаблСписПартий, ТаблСписПартийКом;
	Перем ВремРегистры;
	Перем ВремПартииОтданные, ВремПокупатели;
//	
//	// Удаление движений по регистрам.
//	Для Номер = 1 По Метаданные.Регистр() Цикл
//		ОчиститьДвижения("Регистр."+Метаданные.Регистр(Номер).Идентификатор);
//	КонецЦикла;
//
//	ТаблСписПартий=СоздатьОбъект("ТаблицаЗначений");
//	ТаблицаУслуг = СоздатьОбъект("ТаблицаЗначений");  
//	
//	Если глЕстьРеквизитШапки("ФлагСвертки", ДокОснование.Вид())=1 Тогда
//		Если ДокОснование.ФлагСвертки = 1 Тогда	
//			КурсРубля = глКурсДляВалюты(глРубли, ДатаДок);
//			КратРубля = глКратностьДляВалюты(глРубли, ДатаДок);
//			
//			ВыбратьСтроки();
//			Пока ПолучитьСтроку()=1 Цикл
//				Если (ПустоеЗначение(ВидСтатус) = 1) Тогда
//					НазначитьТип("ВидСтатус", "Перечисление.ВидыТМЦ");                           
//					ВидСтатус     = Перечисление.ВидыТМЦ.Товар;
//				КонецЕсли;
//				
//				Если (Номенклатура.ВидНоменклатуры <> Перечисление.ВидыНоменклатуры.Услуга)
//				и    (Номенклатура.ВидНоменклатуры <> Перечисление.ВидыНоменклатуры.Работа)
//				и    (Себестоимость = 0)
//				Тогда
//					
//					Себестоимость = глПересчет(Сумма 
//					                           - ?(СуммаВклНДС = 1,СуммаНДС,0)
//											   - ?(СуммаВклНП  = 1,СуммаНП, 0),
//											   Валюта, Курс,
//											   глРубли,КурсРубля,Кратность,КратРубля);
//		            СебестоимостьЦена = ?(Количество = 0, 0, Себестоимость/Количество);
//					СебестоимостьНДС  = глПересчет(СуммаНДС,
//											   Валюта, Курс,
//											   глРубли,КурсРубля,Кратность,КратРубля);
//	
//				КонецЕсли;
//				// Т.К. основания нет, если не выбрана конкретная партия, надо создать новую по возврату
//				Если ПустоеЗначение(Партия) = 1 Тогда
//				    
//					Если ПустоеЗначение(Номенклатура) = 1 Тогда
//				        СтатусВозврата(0);
//						Сообщить("В строке "  + НомерСтроки + " не выбрана номеклатура");
//						Возврат;
//					КонецЕсли;
//					
//					СпрПартии = СоздатьОбъект("Справочник.Партии");
//					СпрПартии.ИспользоватьВладельца(Номенклатура);
//					СпрПартии.Новый();
//					СпрПартии.Записать();           
//					Партия = СпрПартии.ТекущийЭлемент();	
//				КонецЕсли;                                 
//			КонецЦикла;
//		КонецЕсли;
//	КонецЕсли;
//
//	ТаблицаТМЦ   = глПодготовитьТаблицуДокумента(Контекст,1,ТаблицаУслуг);
//	
//	СписокПараметров=СоздатьОбъект("СписокЗначений");
//	
//	СписокПараметров.ДобавитьЗначение(ТекущийДокумент(),"ТекДок");
//	СписокПараметров.ДобавитьЗначение(Склад,		"Склад");
//	СписокПараметров.ДобавитьЗначение(Фирма,		"Фирма");
//	СписокПараметров.ДобавитьЗначение(Фирма,		"ФирмаДляОстатковТМЦ");
//	СписокПараметров.ДобавитьЗначение(Контрагент,	"Контрагент");
//	СписокПараметров.ДобавитьЗначение(Договор,		"Договор");
//	СписокПараметров.ДобавитьЗначение(1,			"ЗнакДвижения");
//	
//	СписокПараметров.ДобавитьЗначение(КодОперации,	"КодОперации");
//	
//	ВремРегистры = СоздатьОбъект("Регистры");
//	Если КодОперации = Перечисление.КодыОпераций.ВозвратОтРеализатора Тогда
//		ВремПартииОтданные = ВремРегистры.ПартииОтданные;
//		глФильтрПартийТМЦ(Контекст,ТаблицаТМЦ, СписокПараметров, ВремПартииОтданные);
//	Иначе
//		ВремПокупатели = ВремРегистры.Покупатели;
//		глФильтрДолгов(Контекст, Договор, СписокПараметров, ВремПокупатели);
//	КонецЕсли;                        
//	
//	Если ИтогиАктуальны() = 0 Тогда   
//		ВремРегистры.Актуальность(1);
//		ВремРегистры.РассчитатьРегистрыНа(ТекущийДокумент());
//	КонецЕсли;
//	
//	глПриходОстатковТМЦ	(Контекст,ТаблицаТМЦ,СписокПараметров);
//	
//	Если (КодОперации=Перечисление.КодыОпераций.ВозвратОтПокупателя)
//	 или (КодОперации=Перечисление.КодыОпераций.ВозвратОтПокупателяЕНВД) Тогда
//		
//		глОприходованиеПартийТМЦВозврат(Контекст,ТаблицаТМЦ,СписокПараметров,ТаблСписПартий,ТаблСписПартийКом);
//		
//		// Если мы возвращаем товар, проданный в рознице не на розничный склад, то его нужно вернуть из розницы
//		Если Склад.РозничныйСклад = 0 Тогда
//			ПеремещениеИзРозницы(ТаблицаТМЦ,ТаблСписПартий, СписокПараметров);
//		КонецЕсли; 
//
//		// обороты продаж - в минус
//		ТаблСписПартий.ВыбратьСтроки();
//		Пока ТаблСписПартий.ПолучитьСтроку()=1 Цикл
//			глДвижениеОборотовПродаж(Контекст,
//									Фирма,
//									Контрагент,
//									ТаблСписПартий.Партия.Поставщик,
//									ТаблСписПартий.Номенклатура,
//									-ТаблСписПартий.Количество,
//									-ТаблСписПартий.СуммаУпр,
//									-ТаблСписПартий.СуммаПродУпр);
//		КонецЦикла;
//		
//		ТаблСписПартий.Свернуть("СтатусПартии,СтавкаНП,СтавкаНДС,ДоговорКомитента","СуммаПрод,СуммаПродУпр,СуммаПродРуб,НДСПрод,НППрод,СуммаБезНДС");
//		ТаблСписПартий.НоваяКолонка("КредДокумент");
//		ТаблСписПартий.НоваяКолонка("ВидДолга");
//		ТаблСписПартий.НоваяКолонка("Сумма");
//		ТаблСписПартий.НоваяКолонка("СуммаУпр");
//		ТаблСписПартий.НоваяКолонка("СуммаРуб");
//		ТаблСписПартий.НоваяКолонка("СуммаНДС");
//		ТаблСписПартий.НоваяКолонка("СуммаНП");
//		ТаблСписПартий.НоваяКолонка("Себестоимость");
//		ТаблСписПартий.НоваяКолонка("ОблагаетсяНП");
//		
//		ТаблСписПартий.ВыбратьСтроки();
//		Пока ТаблСписПартий.ПолучитьСтроку()=1 Цикл
//			ТаблСписПартий.КредДокумент = ТекущийДокумент();
//			ТаблСписПартий.ВидДолга		= ВидДолгаПоСтатусу(ТаблСписПартий.СтатусПартии);
//			ТаблСписПартий.Себестоимость= ТаблСписПартий.СуммаБезНДС;
//			ТаблСписПартий.СуммаНДС		= ТаблСписПартий.НДСПрод;
//			ТаблСписПартий.СуммаНП		= ТаблСписПартий.НППрод;
//			ТаблСписПартий.Сумма		= ТаблСписПартий.СуммаПрод;
//			ТаблСписПартий.СуммаУпр		= ТаблСписПартий.СуммаПродУпр;
//			ТаблСписПартий.СуммаРуб		= ТаблСписПартий.СуммаПродРуб;
//			ТаблСписПартий.ОблагаетсяНП = УчитыватьНП;
//		КонецЦикла;                                                                       
//		                                                            
//		СписокПараметров.Установить("ЗнакДвижения", - 1); // идет уменьшение долга
//		глДвижениеДолгов(Контекст, Договор, ТаблСписПартий,СписокПараметров,ВремПокупатели);
//		                              
//		// запомним, что мы вернули принятые на комиссию товары...
//		ТаблСписПартийКом.ВыбратьСтроки();
//		Пока ТаблСписПартийКом.ПолучитьСтроку()=1 Цикл                    
//			Регистр.РеализованныйТовар.Фирма 			= ТаблСписПартийКом.Фирма;
//			Регистр.РеализованныйТовар.Договор 			= ТаблСписПартийКом.Партия.ДоговорПоставщика;
//			Регистр.РеализованныйТовар.Номенклатура 	= ТаблСписПартийКом.Номенклатура;
//			Регистр.РеализованныйТовар.Партия 			= ТаблСписПартийКом.Партия;
//			Регистр.РеализованныйТовар.ДокПродажи		= ТекущийДокумент();
//			Регистр.РеализованныйТовар.Количество 		= - ТаблСписПартийКом.Количество;
//			Регистр.РеализованныйТовар.ПродСтоимость 	= - (ТаблСписПартийКом.СуммаПродРуб - ТаблСписПартийКом.НППрод);
//			Регистр.РеализованныйТовар.ДвижениеПриходВыполнить();
//		КонецЦикла;      
//		
//		// реализация услуг   
//		глДвижениеПартийУслуг(Контекст, ТаблицаУслуг, СписокПараметров, 1);
//		
//		// сначала уменьшим обороты продаж по услугам и работам
//		ТаблицаУслуг.ВыбратьСтроки();
//		Пока ТаблицаУслуг.ПолучитьСтроку()=1 Цикл
//			глДвижениеОборотовПродаж(Контекст,
//									Фирма,
//									Контрагент,
//									"",
//									ТаблицаУслуг.Номенклатура,
//									-ТаблицаУслуг.Количество,
//									0,
//									-ТаблицаУслуг.СуммаУпр);
//		КонецЦикла;
//		
//		// теперь задолженность покупателя за отпущенные услуги или работы
//		СписокПараметров.Установить("ЗнакДвижения",-1); // уменьшился долг клиента
//		
//		ТаблицаУслуг.Свернуть("Вид,СтавкаНДС,СтавкаНП","Сумма,СуммаУпр,СуммаРуб,СуммаНДС,СуммаНП");
//		
//		ТаблицаУслуг.НоваяКолонка("КредДокумент");
//		ТаблицаУслуг.НоваяКолонка("ВидДолга");
//		ТаблицаУслуг.НоваяКолонка("Себестоимость");
//		ТаблицаУслуг.НоваяКолонка("ДоговорКомитента");
//		ТаблицаУслуг.НоваяКолонка("ОблагаетсяНП");
//	
//		ТаблицаУслуг.ВыбратьСтроки();
//		Пока ТаблицаУслуг.ПолучитьСтроку()=1 Цикл
//		
//			ТаблицаУслуг.КредДокумент 	= ТекущийДокумент();
//
//			Если ТаблицаУслуг.Вид = Перечисление.ВидыНоменклатуры.Услуга Тогда
//				ТаблицаУслуг.ВидДолга		= глВД.ДолгЗаУслуги;
//			Иначе
//				ТаблицаУслуг.ВидДолга		= глВД.ДолгЗаРаботы;
//			КонецЕсли;
//
//			ТаблицаУслуг.Себестоимость	= 0;
//			ТаблицаУслуг.ОблагаетсяНП 	= УчитыватьНП;
//		
//		КонецЦикла;                                                                       
//	    глДвижениеДолгов(Контекст, Договор, ТаблицаУслуг, СписокПараметров, ВремПокупатели);
//		
//	Иначе // отданные на реализацию возвращаем
//		глСписаниеПартийТМЦ(Контекст,ТаблицаТМЦ,СписокПараметров,ВремПартииОтданные, ТаблСписПартий);
//		    
//		ТаблСписПартий.ВыбратьСТроки();
//		Пока  ТаблСписПартий.ПолучитьСтроку()=1 Цикл
//			Регистр.ПартииНаличие.ПривязыватьСтроку(ТаблСписПартий.НомерСтрокиДокумента);
//
//			//измерения
//			Регистр.ПартииНаличие. Фирма 			= Фирма;
//			Регистр.ПартииНаличие. МОЛ				= Склад.МОЛ;
//			Регистр.ПартииНаличие. Номенклатура		= ТаблСписПартий.Номенклатура;
//			Регистр.ПартииНаличие. СтатусПартии		= ТаблСписПартий.СтатусПартии;
//
//			МетодРасчетаСебестоимости = Фирма.ЮрЛицо.МетодРасчетаСебестоимости.Получить(ДатаДок);   
//
//			Если (МетодРасчетаСебестоимости <> Перечисление.МетодыРасчетаСебестоимости.FIFO)
//			   и (МетодРасчетаСебестоимости <> Перечисление.МетодыРасчетаСебестоимости.LIFO) Тогда 
//				Регистр.ПартииНаличие.Партия  		= ПолучитьПустоеЗначение("Справочник.Партии");
//				Регистр.ПартииНаличие.ДатаПартии	= "";
//			Иначе
//				Регистр.ПартииНаличие.Партия		= ТаблСписПартий.Партия;
//				Регистр.ПартииНаличие.ДатаПартии	= ДатаДок;
//			КонецЕсли;
//
//			// ресурсы
//			Регистр.ПартииНаличие. Количество		= ТаблСписПартий.Количество;
//			Регистр.ПартииНаличие. СуммаУпр			= ТаблСписПартий.СуммаУпр;
//			Регистр.ПартииНаличие. СуммаРуб			= ТаблСписПартий.СуммаРуб;
//			Регистр.ПартииНаличие. СуммаБезНДС		= ТаблСписПартий.СуммаБезНДС;
//
//			// реквизиты
//			Регистр.ПартииНаличие. КодОперации		= глКО.ВозвратОтРеализатора;
//			
//			Регистр.ПартииНаличие.ДвижениеПриходВыполнить();
//		КонецЦикла;
//		
//		// проверим, а не указал ли услуги или работы - их отдавать на релизацию нельзя
//		ТаблицаУслуг.ВыбратьСтроки();
//		Если ТаблицаУслуг.ПолучитьСтроку()= 1 Тогда
//			глНеПроводить(Контекст,"Услуги возвращать от комиссионера невозможно! ("+ТаблицаУслуг.Номенклатура+")");
//			Возврат;
//		КонецЕсли;
//		
//	КонецЕсли;
//	                                  
КонецПроцедуры // ПроведениеПоРегистрам()

////////////////////////////////////////////////////////////////////////////////
// ПРЕДОПРЕДЕЛЕННЫЕ ПРОЦЕДУРЫ
//
//******************************************************************************
// Предопределенная процедура.
//
Процедура ОбработкаПроведения(Отказ, Режим)
//	
//	Если ДокОснование.Выбран() = 1 Тогда
//		Если ДокОснование.ФлагСвертки = 1 Тогда
//			Возврат;
//		КонецЕсли;
//	КонецЕсли;
//	
//	// Проверка заполненности обязательных реквизитов.
//	Если глВсеРеквизитыДокументаЗаполнены(Контекст,
//		"Фирма,Склад,Валюта,Контрагент,Договор")=0 Тогда
//		Возврат;
//	КонецЕсли;  
//	    
//	// проверка: на основании реализационного документа нельзя  вводить
//	// документ купли - продажи и наоборот
//	Если ДокОснование.Выбран() = 1 Тогда                        
//		НельзяВводить = 0;
//		Если ДокОснование.Вид() = "Реализация"	Тогда
//			Если (   (ДокОснование.КодОперации = глКО.ПередачаНаРеализацию)
//			      и  (( КодОперации  = глКО.ВозвратОтПокупателя) или ( КодОперации  = глКО.ВозвратОтПокупателяЕНВД) ))
//			или  (   (ДокОснование.КодОперации = глКО.Продажа)
//			      и  (КодОперации  = глКО.ВозвратОтРеализатора))
//			Тогда     
//				НельзяВводить = 1;
//			КонецЕсли;  
//		ИначеЕсли КодОперации  = глКО.ВозвратОтРеализатора Тогда // остались только нереализационные основания
//			НельзяВводить = 1;
//		КонецЕсли;
//		Если НельзяВводить = 1 Тогда
//			глНеПроводить(Контекст,"На основании документа """+глНазваниеДокументаВЖурнале(ДокОснование)+"""
//			|нельзя вводить """ + глНазваниеДокументаВЖурнале(Контекст) + """!");
//			Возврат;
//		КонецЕсли;  
//	КонецЕсли;
//	
//	// Облагаться ЕНВД может только возврат на розничный склад
//	Если ОблагаетсяЕНВД = 1 Тогда
//		Если КодОперации  <> глКО.ВозвратОтПокупателяЕНВД Тогда
//			глНеПроводить(Контекст,"Код операции не соответствует флагу учета ЕНВД!"); 
//			Возврат;
//	    КонецЕсли;
//	КонецЕсли;
//	
//	// Проверка на достаточное количество отгруженных товаров по док основанию с учетом других возвратов
//    Если ДокОснование.Выбран() = 1 Тогда
//		
//		ТаблицаТоваров = СоздатьОбъект("ТаблицаЗначений");
//		ВыгрузитьТабличнуюЧасть(ТаблицаТоваров, "Номенклатура, Количество, Коэффициент");
//	
//		ТаблицаТоваров.ВыбратьСтроки();
//	
//		Пока ТаблицаТоваров.ПолучитьСтроку() = 1 Цикл
//			ТаблицаТоваров.Количество = ТаблицаТоваров.Количество * ТаблицаТоваров.Коэффициент;
//		КонецЦикла;
//
//		ТаблицаТоваров.Свернуть("Номенклатура", "Количество");
//        Возвраты = СоздатьОбъект("Документ");
//		
//		Если Возвраты.ВыбратьПодчиненныеДокументы(ДокОснование.ДатаДок, ДатаДок, ДокОснование) = 1 Тогда
//			Пока Возвраты.ПолучитьДокумент() = 1 Цикл
//				Если Возвраты.Вид() = "ВозвратОтПокупателя" Тогда
//					Если (Возвраты.Проведен() = 1) И (Возвраты.ТекущийДокумент() <> ТекущийДокумент()) Тогда
//						Если Возвраты.ВыбратьСтроки() = 1 Тогда
//							Пока Возвраты.ПолучитьСтроку() = 1 Цикл
//								СтрокаТовара = 0;
//								КолонкаТовара = 1;
//								Если ТаблицаТоваров.НайтиЗначение(Возвраты.Номенклатура, СтрокаТовара, КолонкаТовара) = 1 Тогда
//									ТаблицаТоваров.УстановитьЗначение(СтрокаТовара, 2, ТаблицаТоваров.ПолучитьЗначение(СтрокаТовара,2) + Возвраты.Количество * Возвраты.Коэффициент);
//								КонецЕсли;
//							КонецЦикла;
//						КонецЕсли;
//					КонецЕсли;
//				КонецЕсли;
//			КонецЦикла;
//		КонецЕсли;
//    
//		ТаблицаОснования = СоздатьОбъект("ТаблицаЗначений");
//		
//		ДокОснование.ВыгрузитьТабличнуюЧасть(ТаблицаОснования, "Номенклатура, Количество, Коэффициент");
//	 	
//		ТаблицаОснования.ВыбратьСтроки();
//	
//		Пока ТаблицаОснования.ПолучитьСтроку() = 1 Цикл
//			ТаблицаОснования.Количество = ТаблицаОснования.Количество * ТаблицаОснования.Коэффициент;
//		КонецЦикла;
//		
//		ТаблицаОснования.Свернуть("Номенклатура", "Количество");
//	
//		ТаблицаТоваров.ВыбратьСтроки();
//		Пока ТаблицаТоваров.ПолучитьСтроку() = 1 Цикл
//			
//			СтрокаОснования = 0;
//
//			Если ТаблицаОснования.НайтиЗначение(ТаблицаТоваров.Номенклатура, СтрокаОснования, 1) = 1 Тогда
//				Если ТаблицаТоваров.Количество > ТаблицаОснования.ПолучитьЗначение(СтрокаОснования,2) Тогда
//					Сообщение = "По " + ДокОснование + " возвращено больше, чем отпущено " + ТаблицаТоваров.Номенклатура;
//					глСообщениеПроведения(Сообщение , ТекущийДокумент(), 1,,1);
//					
//				КонецЕсли;
//		
//			Иначе
//				Сообщение = "По " + ДокОснование + " не отпускалось " + ТаблицаТоваров.Номенклатура;
//				глСообщениеПроведения(Сообщение , ТекущийДокумент(), 1,,1);
//				
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//	// Проведение по регистрам оперативного учета.	
//	Если (ПустоеЗначение(ВидыДвижений) = 1) ИЛИ (Найти(ВидыДвижений, "Регистр") <> 0) Тогда
//		ПроведениеПоРегистрам();
//		
//		Если СтатусВозврата() = 0 Тогда
//			Возврат;
//		КонецЕсли;
//	КонецЕсли;
//	
//	глПриПроведении(Контекст, ВидыДвижений);
//	
КонецПроцедуры //ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, Режим)
	Сумма_Итог = ТабличнаяЧасть1.Итог("Сумма");
	СуммаНДС_Итог = ТабличнаяЧасть1.Итог("СуммаНДС");
	СуммаНП_Итог = ТабличнаяЧасть1.Итог("СуммаНП");
КонецПроцедуры
//
//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
